{"id":"dab10915-16eb-4021-8a3d-ceeb699d3b7e","review_title":"Great phone","review_body":"Battery lasts all day and camera is excellent","product_id":"PHONE-123","review_rating":5,"timestamp":"2025-07-12T14:43:05.387132600+00:00"}
{"id":"ad45a16c-8177-42ff-b096-7d40d8e16e3d","review_title":"Mock Up","review_body":"This paddle sport supply store is stocked to the rafters with a staggering selection of everything you could possibly ever need to get your crazy paddle on.  Owners, Jeff and Darren, are friendly and quick to answer even silly newbie questions.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:47:40.793831+00:00"}
{"id":"2abe48a4-a482-4522-b8a8-4120003d7c3b","review_title":"Mock Up","review_body":"This place is a veritable candy store for outdoor enthusiasts, especially kayak and canoers. Really friendly and knowledgeable people ready to help. They have a huge inventory of watercraft out back, so don't get fooled by the size of the building or showroom. The building backs up to a channel that makes it possible to test drive a kayak or canoe. One word of warning - you will want to buy something, anything, when you walk in.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:47:58.243881300+00:00"}
{"id":"2ba242d2-5895-409f-bec9-39bd0e589e46","review_title":"Mock Up","review_body":"I've done quite a bit of canoeing and kayaking - lakes, rivers, whitewater, but, never actually owned my own Kayak.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:48:20.702284700+00:00"}
{"id":"dcb2c077-dfc1-4beb-802a-6f6ff97c2665","review_title":"Mock Up","review_body":"I live on the Sugar River and was looking for a nice boat that had a good balance of maneuverability, stability, tracking, and efficiency so I could use it on the river but, also take it on nice paddles on lakes.The staff were excellent about helping me and very patient as I tried numerous boats, over and over and over, at their test area located on the channel between Lake Monona and Upper Mud Lake on the Yahara.  In the end, I ended up picking the boat that TWO staff people first recommended right from the start.  They listened to my needs, helped me extensively, and made some really good recommendations for selection of a paddle and other accessories.I've since purchased the boat and have had MANY opportunities to paddle it - on flat water, rivers, and some small rapids.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:48:41.502606+00:00"}
{"id":"f4a8bf34-93d1-4d7f-afa9-011c7af63039","review_title":"Mock Up","review_body":"The boat has been great for me.I will definitely come back - we are looking at another purchase for my wife.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:49:21.906075200+00:00"}
{"id":"6555c62f-5f86-4e56-ba8b-b4906f7a11d9","review_title":"Mock Up","review_body":"Great place to rent kayaks for a little bit of exercise and sun...","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:49:43.001513+00:00"}
{"id":"6869d4ff-e15b-48d5-8a76-a7d5a24420c8","review_title":"Mock Up","review_body":"Amazing selection of product, and very knowledgable staff. Location is great because you can paddle right from the back door.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:50:28.290026300+00:00"}
{"id":"9d18b483-b651-420f-9fae-473866adfc62","review_title":"Mock Up","review_body":"Stopped here on my way up north and picked up a paddleboard. Staff was super attentive and knowledgeable while helping me get correct board for my size. I will definitely go back.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:50:58.662397800+00:00"}
{"id":"0c93acde-a720-4d28-ab40-414d8d169001","review_title":"Mock Up","review_body":"Rutabaga, What is itIt's the ultimate personal powered watercraft store I've ever seen.  Gear, boats of all shapes, styles, sizes and pricepoints, clothing, even racks to put them on your vehicle!  They might even carry bicycle racks.  A word about racks:  There are A LOT of fitment issues with racks.  No salesperson can know all details about all vehicle fitments and your personal quirks.  Their information on many vehicles has to be based on product fitment catalogs, the same catalogs that you as a consumer have access to online.  Inform yourself and don't expect a kayakcanoe store salesperson to know all the in's and out's of your particular vehicle and how it works with a bike rack.  How's the Thule fit my 79   Will it squeek  Derp.I recieved total personal attention when I chose to buy a kayak.  I tried out no less than 8 boats to find one that fit me, my paddling goals and my price range.  I purchased a boat, paddle, PFD, and a rack system.  I was personally helped by various individuals to help me decide on all of these items.  I was helped to install my rack for the first time and shown how to safely tie off my kayak.These folks WANT you to come back and thier service shows that.  If it floats  I'm buying it at Rutabaga.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:51:26.114064700+00:00"}
{"id":"0efd52b0-1d3d-49e9-b985-e3f03a94488a","review_title":"Mock Up","review_body":"They earned my respect and my patronage.Paddle on.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:51:39.032450100+00:00"}
{"id":"24ae211c-b34d-4709-a8f3-e83d9147839b","review_title":"Mock Up","review_body":"We rolled in a little after 7; they close at 8. I needed a roof rack for my 240; hard to find. Staff patiently went through options and brought examples out. We rolled away with a sweet rack setup and installed; a little after 8.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:52:03.558362700+00:00"}
{"id":"9bc6f6bb-bd02-45fe-991e-c3db7a5f69e2","review_title":"Mock Up","review_body":"Couldn't have been better.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:52:17.703341800+00:00"}
{"id":"bcc229b9-18cd-46ba-914d-0cba93207006","review_title":"Mock Up","review_body":"Baby it's cold outside. But I'm so prepared for snow it's not even funny! Now here's the thing...I was a desert dweller for close to seven years, so when I moved to Madison in autumn 2012 I refused to believe that temps drop as low as people proclaimed. And my first winter here was mild. Last year, however, was rough stuff. I remember being told to stay indoors and was warned not to go outside without my face covered by several reputable weather peeps. It was brisk... rull brisk. So this year I decided I was going to do winter right! And for me that meant paying a premium for a base layer (top and bottom) that I plan to live in until May. There are several websites that offer an insane amount of information comparing and contrasting fiber counts and materials and weight and oder retention, and then there's Rutabaga. Where owner Darren has his equipped team of outdoorsmen and outdoors-women are prepared to answer pretty much any question about any product they carry. And what's more, they've all been there... in the great outdoors. The gent going back and forth with me today talked up the IceBreaker Merino Wool tight and crew, explaining that to him, nothing feels better. (And he wears the stuff on the daily.) He also led me to another option, super.natural, which comes in at a lower price-point but doesn't have the fab feel of the more expensive option. He also mentioned that super.natural tends to fit a bit closer to the body. At this point it was time to try things on. And even though they have a generous return policy, I wanted to leave with something I knew I'd love. So I'm in the fitting room with both brands' top and bottom and just as described, the IceBreaker felt great but the super.natural fit great. And at the end of the day, knowing I wanted to take home two sets, I went with the super.natural for fit and price, and picked up a pair of socks to complete my ensemble. They carry Smart Wool in every solid, pattern, stripe and polka dot, and an interesting brand made in the US called FITS, which has a cool heel lock that's supposed to keep the sock in place. I thought I was going to walk out of there with some Smart Wool as friends talk it up like it's gold for your feet, but after hearing about the quality going downhill since inception, FITS is what I was feeling.I can't remember the last time I spent so much on underwear. I'm going to say never. But it'll be worth the money when later this month everyone else feels like a popsicle and I'm warm but not toast, breathable and not damp. Rutabaga also has a stellar selection of snow shoes, and I'm eying a pair from a company based in Denver that uses 95% recycled material to make a Cadillac-like kick. If you're not up for the investment, they also rent winter equipment, and a big part of their business is paddlesports come summer.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:52:51.224471+00:00"}
{"id":"ed8d2a1d-ac85-4f64-940e-0dbf97fc090e","review_title":"Mock Up","review_body":"Phenomenal locally owned store for outdoor enthusiasts. I like to buy local whenever I can and this store reminds me a lot of REI but with the added bonus of being locally owned. I've always received outstanding customer service and found the staff to go out of their way to find a solution for me. I just finished my holiday shopping here because they have a ton of little things that make great stocking stuffers for anyone like balms, solar lights for camping, doggy gear, kid stuff, etc. I often like to gauge a business by the happiness of its employees and when I talk with them about working at Rutabaga, they never hesitate to sing the praises of this very cool store. Looking forward to my next visit!","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:53:22.319675500+00:00"}
{"id":"6c5e22b9-7842-4c10-8979-c6735469c034","review_title":"Mock Up","review_body":"this little place was great! fun day with great jet skis...the older couple is extremely nice and made for an affordable fun time at the lake. I would highly recommend giving these guys a chance! they have the trailer hitch if you need and include many sized life jackets.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:53:34.035967300+00:00"}
{"id":"df1ca049-4cf2-4cb7-8c3f-080adacf40e4","review_title":"Mock Up","review_body":"The owners Chris and joe were extremely nice. They took my reservation without a credit card. I rented two decent wave runners for $125 each for the whole day. $300 deposit on each. Brought them back at 5.30 in the same condition I picks them up. TheY threw in the life jackets and a hitch and trailer for the skis. This really is the best deal in town and 33 minute drive to the lake. Awesome day on the lake","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:53:57.409525100+00:00"}
{"id":"1a9c3334-092f-4e47-a773-3fc59c896233","review_title":"Mock Up","review_body":"Best of the best. Awesome prices. Great running skis. Super Duper friendly as can be. Very nice, down to earth people. Life jackets, trailer, anchor, ties...everything you need supplied. I'll definitely be back. Maybe rent one of their boats. I can't say enough good things about this company...","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-12T15:54:14.196595500+00:00"}
{"id":"942e7228-87f8-4be9-b0fd-502ec803a120","review_title":"Mock Up","review_body":"Friend found this place for our yearly trip to Lake Mead.   We have rented from other local places and these guys are very nice and informal.  No long video to watch and we're not overly suspicious of us.  Skis were in good shape and ran well all weekend. They worked with us on return time.   Easy transaction.  I left $300 which I got back the same 3 hundred bills I left.   Chris and Joe are great and plan on using them on all our future trips.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T07:59:58.313807700+00:00"}
{"id":"b626e537-2096-4f1d-9c3c-a8f60eba6106","review_title":"So Bad and hard to use this product ","review_body":"So Bad and hard to use this product ","product_id":"IPHONE-20","review_rating":3,"timestamp":"2025-07-13T09:10:44.414618+00:00"}
