{"id":"99a9e136-83d6-433f-bfd4-087d649354b6","review_title":"Mock Up","review_body":"Friend found this place for our yearly trip to Lake Mead.   We have rented from other local places and these guys are very nice and informal.  No long video to watch and we're not overly suspicious of us.  Skis were in good shape and ran well all weekend. They worked with us on return time.   Easy transaction.  I left $300 which I got back the same 3 hundred bills I left.   Chris and Joe are great and plan on using them on all our future trips.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:22:55.143510100+00:00"}
{"id":"3bab1053-e2d4-4bbf-8377-ab71df9b1cf3","review_title":"Mock Up","review_body":"Best of the best. Awesome prices. Great running skis. Super Duper friendly as can be. Very nice, down to earth people. Life jackets, trailer, anchor, ties...everything you need supplied. I'll definitely be back. Maybe rent one of their boats. I can't say enough good things about this company...","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:23:10.099223800+00:00"}
{"id":"8fa52c4a-6cae-479c-bf59-b4278c62cf0e","review_title":"Mock Up","review_body":"The owners Chris and joe were extremely nice. They took my reservation without a credit card. I rented two decent wave runners for $125 each for the whole day. $300 deposit on each. Brought them back at 5.30 in the same condition I picks them up. TheY threw in the life jackets and a hitch and trailer for the skis. This really is the best deal in town and 33 minute drive to the lake. Awesome day on the lake","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:23:29.532148200+00:00"}
{"id":"f189fb50-65bc-4d32-8782-2d001ce7094d","review_title":"Mock Up","review_body":"this little place was great! fun day with great jet skis...the older couple is extremely nice and made for an affordable fun time at the lake. I would highly recommend giving these guys a chance! they have the trailer hitch if you need and include many sized life jackets.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:23:39.148668900+00:00"}
{"id":"ac0b85e6-7963-4634-bc52-4dd7eb224031","review_title":"Mock Up","review_body":"Phenomenal locally owned store for outdoor enthusiasts. I like to buy local whenever I can and this store reminds me a lot of REI but with the added bonus of being locally owned. I've always received outstanding customer service and found the staff to go out of their way to find a solution for me. I just finished my holiday shopping here because they have a ton of little things that make great stocking stuffers for anyone like balms, solar lights for camping, doggy gear, kid stuff, etc. I often like to gauge a business by the happiness of its employees and when I talk with them about working at Rutabaga, they never hesitate to sing the praises of this very cool store. Looking forward to my next visit!","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:23:49.547647+00:00"}
{"id":"9e4e81b0-1281-4cd3-8a21-d80c9f74e70a","review_title":"Mock Up","review_body":"This paddle sport supply store is stocked to the rafters with a staggering selection of everything you could possibly ever need to get your crazy paddle on.  Owners, Jeff and Darren, are friendly and quick to answer even silly newbie questions.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:24:16.058705300+00:00"}
{"id":"f17a3036-1016-423e-898c-042b31211ccf","review_title":"Mock Up","review_body":"This place is a veritable candy store for outdoor enthusiasts, especially kayak and canoers. Really friendly and knowledgeable people ready to help. They have a huge inventory of watercraft out back, so don't get fooled by the size of the building or showroom. The building backs up to a channel that makes it possible to test drive a kayak or canoe. One word of warning - you will want to buy something, anything, when you walk in.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:24:25.670388500+00:00"}
{"id":"895086e9-9c8a-4913-af5a-441fb1b39ca6","review_title":"Mock Up","review_body":"I've done quite a bit of canoeing and kayaking - lakes, rivers, whitewater, but, never actually owned my own Kayak. ","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:24:36.691988100+00:00"}
{"id":"57ab6d20-b284-4ad5-95a0-c9c0e480e1b5","review_title":"Mock Up","review_body":"I live on the Sugar River and was looking for a nice boat that had a good balance of maneuverability, stability, tracking, and efficiency so I could use it on the river but, also take it on nice paddles on lakes.The staff were excellent about helping me and very patient as I tried numerous boats, over and over and over, at their test area located on the channel between Lake Monona and Upper Mud Lake on the Yahara.  In the end, I ended up picking the boat that TWO staff people first recommended right from the start.  They listened to my needs, helped me extensively, and made some really good recommendations for selection of a paddle and other accessories.I've since purchased the boat and have had MANY opportunities to paddle it - on flat water, rivers, and some small rapids.  The boat has been great for me.I will definitely come back - we are looking at another purchase for my wife.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:24:54.810383300+00:00"}
{"id":"6a29d688-ef7a-4780-a87b-9d0ae1b0a7b8","review_title":"Mock Up","review_body":"Great place to rent kayaks for a little bit of exercise and sun...","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:25:03.974108800+00:00"}
{"id":"bdad4c9f-909e-4f3a-9c36-74f0eb7ed9a5","review_title":"Mock Up","review_body":"Amazing selection of product, and very knowledgable staff. Location is great because you can paddle right from the back door.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:25:14.035169700+00:00"}
{"id":"5db03b2c-6a2f-4875-aacc-585eb84e7d41","review_title":"Mock Up","review_body":"Stopped here on my way up north and picked up a paddleboard. Staff was super attentive and knowledgeable while helping me get correct board for my size. I will definitely go back.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:25:21.743882400+00:00"}
{"id":"488787c9-de59-4d9f-bafe-bf7fb7d1ddda","review_title":"Mock Up","review_body":"Couldn't have been better.","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:25:32.563039500+00:00"}
{"id":"c9a27050-a8cb-483f-9208-732d6c2a8c18","review_title":"Mock Up","review_body":"Phenomenal locally owned store for outdoor enthusiasts. I like to buy local whenever I can and this store reminds me a lot of REI but with the added bonus of being locally owned. I've always received outstanding customer service and found the staff to go out of their way to find a solution for me. I just finished my holiday shopping here because they have a ton of little things that make great stocking stuffers for anyone like balms, solar lights for camping, doggy gear, kid stuff, etc. I often like to gauge a business by the happiness of its employees and when I talk with them about working at Rutabaga, they never hesitate to sing the praises of this very cool store. Looking ","product_id":"Mock Up3","review_rating":5,"timestamp":"2025-07-13T09:25:58.943790700+00:00"}
